# Pandas
Pandas providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

https://pandas.pydata.org

* conda install pandas
* python -m pip install --upgrade pandas

In [1]:
import pandas as pd

# Table 
https://www.kaggle.com/c/titanic/data

In [2]:
data = pd.read_csv('train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.Survived

0      0
1      1
2      1
3      1
4      0
5      0
6      0
7      0
8      1
9      1
10     1
11     1
12     0
13     0
14     0
15     1
16     0
17     1
18     0
19     1
20     0
21     1
22     1
23     1
24     0
25     1
26     0
27     0
28     1
29     0
      ..
861    0
862    1
863    0
864    0
865    1
866    1
867    0
868    0
869    1
870    0
871    1
872    0
873    0
874    1
875    1
876    0
877    0
878    0
879    1
880    1
881    0
882    0
883    0
884    0
885    0
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [6]:
type(data.Survived)

pandas.core.series.Series

In [9]:
sum(data.Survived),data.Survived.sum()

(342, 342)

In [10]:
data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [12]:
len(data.Survived),data.Survived.shape

(891, (891,))

In [13]:
data.shape

(891, 12)

In [15]:
data.index

TypeError: 'RangeIndex' object is not callable

In [22]:
data.Survived==1

0      False
1       True
2       True
3       True
4      False
5      False
6      False
7      False
8       True
9       True
10      True
11      True
12     False
13     False
14     False
15      True
16     False
17      True
18     False
19      True
20     False
21      True
22      True
23      True
24     False
25      True
26     False
27     False
28      True
29     False
       ...
861    False
862     True
863    False
864    False
865     True
866     True
867    False
868    False
869     True
870    False
871     True
872    False
873    False
874     True
875     True
876    False
877    False
878    False
879     True
880     True
881    False
882    False
883    False
884    False
885    False
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [24]:
data.iloc[887:891]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [26]:
data.loc[887:891,'Age']

887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, dtype: float64

In [29]:
data.Name.apply(lambda x:x.split(',')[1])

0                                        Mr. Owen Harris
1             Mrs. John Bradley (Florence Briggs Thayer)
2                                            Miss. Laina
3                     Mrs. Jacques Heath (Lily May Peel)
4                                      Mr. William Henry
5                                              Mr. James
6                                          Mr. Timothy J
7                                  Master. Gosta Leonard
8               Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                            Mrs. Nicholas (Adele Achem)
10                                  Miss. Marguerite Rut
11                                       Miss. Elizabeth
12                                     Mr. William Henry
13                                      Mr. Anders Johan
14                           Miss. Hulda Amanda Adolfina
15                               Mrs. (Mary D Kingcome)
16                                        Master. Eugene
17                                    Mr. Charles Eugene
18              Mrs. Julius (Emelia Maria Vandemoortele)
19                                           Mrs. Fatima
20                                          Mr. Joseph J
21                                          Mr. Lawrence
22                                    Miss. Anna "Annie"
23                                  Mr. William Thompson
24                                  Miss. Torborg Danira
25      Mrs. Carl Oscar (Selma Augusta Emilia Johansson)
26                                     Mr. Farred Chehab
27                                 Mr. Charles Alexander
28                                  Miss. Ellen "Nellie"
29                                             Mr. Lalio
                             ...
861                                 Mr. Frederick Edward
862         Mrs. Frederick Joel (Margaret Welles Barron)
863                          Miss. Dorothy Edith "Dolly"
864                                     Mr. John William
865                                      Mrs. (Karolina)
866                                       Miss. Asuncion
867                           Mr. Washington Augustus II
868                                         Mr. Philemon
869                               Master. Harold Theodor
870                                            Mr. Cerin
871               Mrs. Richard Leonard (Sallie Monypeny)
872                                       Mr. Frans Olof
873                                           Mr. Victor
874                         Mrs. Samuel (Hannah Wizosky)
875                            Miss. Adele Kiamie "Jane"
876                                    Mr. Alfred Ossian
877                                          Mr. Nedelio
878                                           Mr. Kristo
879                Mrs. Thomas Jr (Lily Alexenia Wilson)
880                  Mrs. William (Imanita Parrish Hall)
881                                           Mr. Johann
882                                   Miss. Gerda Ulrika
883                                  Mr. Frederick James
884                                         Mr. Henry Jr
885                       Mrs. William (Margaret Norton)
886                                          Rev. Juozas
887                                 Miss. Margaret Edith
888                       Miss. Catherine Helen "Carrie"
889                                      Mr. Karl Howell
890                                          Mr. Patrick
Name: Name, Length: 891, dtype: object

# Assignments

* display tail of three colomns: Survived, Pclass, Age
* use Pclass: show survived by age (5 step years) and class (group by)
* count Mr, Miss, Mrs etc.
* replase nan age to the column mean
* how much did people pay for the tickets? (if sort ascending Fare how much did people pay -- first 90% and last 10%) (use quantile)
* try to find siblings, parents, childrens and export them by family

* create your own table 100x15, generate and export it (use random for numbers and strings)